БухЭксп/DataProcessors/CW_СтандартныйОбмен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>CW_СтандартныйОбмен</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Источник_УИД</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник_СИ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник_Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник_Тип</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_МетаданныеКонфигурации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Загружать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗагруженоУспешно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектСоответствия</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Синхронизация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Источник_Тип</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_МетаданныеКонфигурации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник_Синоним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник_Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник_УИД</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник_СИ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приемник_Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приемник_УИД</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приемник_Объект</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синхронизировано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКартинки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСортировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник_УИД_Родитель</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник_УИД_Владелец</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник_СИ_Родитель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник_СИ_Владелец</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолитикаСинхронизации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ПолитикаСинхронизацииОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СозданиеНового</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектЗаписан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Видимость</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СинхронизацияОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СинхронизацияОбъектов</Name>
			<Comment>Синхронизация объектов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Источник_Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Источник_Тип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МетаданныеКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопИнфо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолитикаСинхронизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПолитикаСинхронизацииОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>флНезавершена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Источник_Идентификатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Обмены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Источник_УИД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Источник_СИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приемник_Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приемник_УИД</Name>
					<Comment>Уид бух. базы</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокОтраженияДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокОтраженияДоходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевыставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственнаяУслуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревыставлениеПоСтавкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеДоходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокОтраженияЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокОтраженияЗатрат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевыставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревыставлениеПоСтавкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ПолитикаСинхронизацииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПолитикаСинхронизацииОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Постоянная</Name>
					<Comment>Обновлять объект при каждой загрузке</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Первичная</Name>
					<Comment>Не обновлять объект, если уже есть синхронизация</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыПеревозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыПеревозок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Контейнер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/DataProcessors/CW_СтандартныйОбмен/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Перем СоответствиеМетаданных;

// информация об обработке
Функция Информация() Экспорт 
	
	СтруктураОписания 		= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте("3.2.0.1");
	СтруктураОписания.Тип 	= CW_ПодключаемыеКомандыСервер.ТипОбработка();
	СтруктураОписания.Вид 	= CW_ПодключаемыеКомандыСервер.ВидОбработкиОбмен();
	
	СтруктураОписания.Наименование 				= "Стандартный обмен";
	СтруктураОписания.Описание 					= "Стандартный обмен с Бухгалтерией экспедитора";
	
	СтруктураОписания.Версия					= "3.2.1.0";
	СтруктураОписания.МинимальнаяВерсияМодуля   = "8.3.10.10";
	
	СтруктураОписания.НастройкаСубъекта   		= Истина;
	
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания, "РегистрируемыеМетаданные");
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания, "ПолучитьОбъекты");
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания, "ВыгрузитьОбъекты");
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания, "РегистрацияРегламентныхЗаданий");
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания, "РегламентныйВызовВыгрузки");
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания, "РегламентныйВызовЗагрузки");
	
	CW_ПодключаемыеКомандыСервер.УстановитьФормыВнешнегоОбъекта(СтруктураОписания, "ФормаНастроекСубъекта", 		"ФормаНастройкиСубъекта");
	CW_ПодключаемыеКомандыСервер.УстановитьФормыВнешнегоОбъекта(СтруктураОписания, "ФормаИнтерактивнойЗагрузки", 	"ФормаИнтерактивнойЗагрузки");
	
	Возврат СтруктураОписания;
	
КонецФункции

// ---------------------------------------------------------------------------- 

Функция РегистрируемыеМетаданные() Экспорт 
	// --- 
	
	Массив = Новый Массив;
	// --- 
	//Массив.Добавить(Новый Структура("Имя,ПередЗаписью,ПриЗаписи,ПередУдалением","Справочник.CW_Заказы",Ложь,Ложь,Ложь));
	//Массив.Добавить(Новый Структура("Имя,ПередЗаписью,ПриЗаписи,ПередУдалением","Справочник.CW_Грузоперевозки",Ложь,Ложь,Ложь));
	//Массив.Добавить(Новый Структура("Имя,ПередЗаписью,ПриЗаписи,ПередУдалением","Справочник.Контрагенты",Ложь,Истина,Ложь));
	//Массив.Добавить(Новый Структура("Имя,ПередЗаписью,ПриЗаписи,ПередУдалением","Справочник.Номенклатура",Ложь,Истина,Ложь));
	//Массив.Добавить(Новый Структура("Имя,ПередЗаписью,ПриЗаписи,ПередУдалением","Справочник.CW_ПлановыеСтатьиЗатратИДоходов",Ложь,Истина,Истина));
	//Массив.Добавить(Новый Структура("Имя,ПередЗаписью,ПриЗаписи,ПередУдалением","Документ.CW_ДоходыПоГрузоперевозке",Ложь,Ложь,Ложь));
	//Массив.Добавить(Новый Структура("Имя,ПередЗаписью,ПриЗаписи,ПередУдалением","Документ.CW_РасходыПоГрузоперевозке",Ложь,Ложь,Ложь));
	//Массив.Добавить(Новый Структура("Имя,ПередЗаписью,ПриЗаписи,ПередУдалением","Документ.CW_ЗакрытиеГрузоперевозки",Ложь,Ложь,Ложь));
	// --- 
	Возврат(Массив);
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

// ХУКИ РЕГИСТРАЦИИ

Процедура РегистрацияПередЗаписью(Источник,СО) Экспорт 
	// --- 
	
	// --- 
		
	// --- 
КонецПроцедуры
  
Процедура РегистрацияПриЗаписи(Источник,СО) Экспорт 
	// --- 
	
	// --- 
	
	// --- 
КонецПроцедуры

Процедура РегистрацияПередУдалением(Источник,СО) Экспорт
	// --- 
	
	// --- 
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

// создание регламентных заданий
// ---------------------------------------------------------------------------- 
Функция РегистрацияРегламентныхЗаданий(Обмен,Параметры=Неопределено) Экспорт 
	// --- 
	
	// настройки будем определять по параметру в параметрах (второй аргумент регл. вызова)
	// ключ №1 - один набор настроек, ключ №2 - другой набор,
	// настройки сохраняем в настройки субъекта
	// при регламентном вызове определяем вариант и читаем настройки для этого ключа
	
	Попытка
		
		УстановитьПривилегированныйРежим(Истина);
		// --- 
		
		// получаем настройки
		Настройки = _ПО.ПолучитьНастройкиСубъекта(Обмен.Обработка,Обмен);
		МассивИдентификаторовРЗ = Новый Массив;
		
		// расписание онлайн-выгрузки
		// ---------------------------------------------------------------------------- 
		РЗ = РегламентныеЗадания.СоздатьРегламентноеЗадание("CW_РегламентнаяВыгрузка");
		РЗ.ИмяПользователя = "";
		РЗ.Наименование = "Выгрузка ("+Строка(Обмен)+"), онлайн"; // будет ещё не онлайн
		РЗ.Ключ = "online";
		// --- 
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(Обмен);
		МассивПараметров.Добавить(Новый Структура("ВариантВыгрузки","online"));
		РЗ.Параметры = МассивПараметров;
		// --- 
		// расписание
		РасписаниеРЗ = _сф.ст_ПолучитьСвойство(Настройки,"Выгрузка_РасписаниеОнлайн").Получить(0).Значение;
		РЗ.Расписание = РасписаниеРЗ;
		// --- 
		РЗ.Использование = Истина;
		// --- 
		РЗ.Записать();
		// --- 
		МассивИдентификаторовРЗ.Добавить(РЗ.УникальныйИдентификатор);
		
		// расписание регламентной выгрузки
		// ---------------------------------------------------------------------------- 
		РЗ = РегламентныеЗадания.СоздатьРегламентноеЗадание("CW_РегламентнаяВыгрузка");
		РЗ.ИмяПользователя = "";
		РЗ.Наименование = "Выгрузка ("+Строка(Обмен)+"), ежедневная";
		РЗ.Ключ = "daily";
		// --- 
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(Обмен);
		МассивПараметров.Добавить(Новый Структура("ВариантВыгрузки","daily"));
		РЗ.Параметры = МассивПараметров;
		// --- 
		// расписание
		РасписаниеРЗ = _сф.ст_ПолучитьСвойство(Настройки,"Выгрузка_РасписаниеЕжедневное").Получить(0).Значение;
		РЗ.Расписание = РасписаниеРЗ;
		// --- 
		РЗ.Использование = Истина;
		// --- 
		РЗ.Записать();
		// --- 
		МассивИдентификаторовРЗ.Добавить(РЗ.УникальныйИдентификатор);
		
		// расписание загрузки
		// ---------------------------------------------------------------------------- 
		РЗ = РегламентныеЗадания.СоздатьРегламентноеЗадание("CW_РегламентнаяЗагрузка");
		РЗ.ИмяПользователя = "";
		РЗ.Наименование = "Загрузка ("+Строка(Обмен)+")"; 
		РЗ.Ключ = "";
		// --- 
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(Обмен);
		МассивПараметров.Добавить(Неопределено);
		РЗ.Параметры = МассивПараметров;
		// --- 
		// расписание
		РасписаниеРЗ = _сф.ст_ПолучитьСвойство(Настройки,"Загрузка_Расписание").Получить(0).Значение;
		РЗ.Расписание = РасписаниеРЗ;
		// --- 
		РЗ.Использование = Истина;
		// --- 
		РЗ.Записать();
		// --- 
		МассивИдентификаторовРЗ.Добавить(РЗ.УникальныйИдентификатор);
		
		// --- 
		УстановитьПривилегированныйРежим(Ложь);
		
	Исключение
		
		CW_Журнал.ОтладочноеСообщение("Обмен.МИС","Создание регламентного задания:"+Символы.ПС+ОписаниеОшибки());
		Возврат(_УФКС.Ответ(1,"Ошибка регистрации регламентных заданий."));
		
	КонецПопытки; 
	
	Ответ = _УФКС.Ответ();
	_сф.ст_УстановитьСвойство(Ответ,"МассивИдентификаторовРегламентныхЗаданий",МассивИдентификаторовРЗ);
	Возврат(Ответ);
	
	// --- 
КонецФункции

// --- 

// регламентная загрузка
Функция РегламентныйВызовЗагрузки(Обмен,Параметры=Неопределено) Экспорт
	// --- 
	
	//// получаем настройки
	//// ---------------------------------------------------------------------------- 
	//УстановитьПривилегированныйРежим(Истина);
	//// --- 
	//Настройки = _ПО.ПолучитьНастройкиСубъекта(Обмен.Обработка,Обмен);
	//// тут необходимо проверить заполнение настроек
	//
	//
	//// читаем файлы, сортируем по типу и дате
	//// ---------------------------------------------------------------------------- 
	//ФайлыКаталога = НайтиФайлы(Настройки.Загрузка_КаталогЗагрузкиФайлов,"*.xml");
	//// --- 
	//ТаблицаФайлов = _сф.т_Создать("Файл,Тип,Дата,Статус");
	//Для каждого Файл Из ФайлыКаталога Цикл
	//	
	//	Нстр = ТаблицаФайлов.Добавить();
	//	Нстр.Файл = Файл;
	//	Нстр.Тип = "FILES"; // сейчас грузим только их
	//	Нстр.Дата = ДатаФайлаИзИмени(Файл.ИмяБезРасширения,Нстр.Тип);
	//	
	//КонецЦикла;
	//ТаблицаФайлов.Сортировать("Дата Возр");
	//
	//// начинаем читать
	//// ----------------------------------------------------------------------------
	//Параметры = _сф.ст_Создать("Обмен,Синхросоответствие,СоответствиеТипов,ИспользуетсяUID,ОсновнойТипПеревозки");
	//Параметры.Обмен = Обмен;
	//Параметры.СинхроСоответствие = Новый Соответствие;
	//Параметры.СоответствиеТипов = ПолучитьСоответствиеТипов();
	//Параметры.ИспользуетсяUID = Ложь;
	//Параметры.ОсновнойТипПеревозки = Настройки.Загрузка_ОсновнойТипПеревозки;
	//
	//Для каждого СтрокаФайла Из ТаблицаФайлов Цикл
	//	
	//	Ответ = ЗагрузитьФайл(Параметры,СтрокаФайла);
	//	// анализируем статус загрузки
	//	
	//	Если _УФКС.ВыполненоУспешно(Ответ) Тогда
	//		
	//		КаталогПеремещения = Настройки.Загрузка_КаталогДляУспешных;
	//		CW_Журнал.ЗаписатьСообщение("Обмен.МИС.Загрузка","info","Файл """+СтрокаФайла.Файл.Имя+""" загружен успешно.");
	//		
	//	Иначе
	//		
	//		КаталогПеремещения = Настройки.Загрузка_КаталогДляОшибочных;
	//		CW_Журнал.ЗаписатьСообщение("Обмен.МИС.Загрузка","error","Файл """+СтрокаФайла.Файл.Имя+""" не загружен:"+Символы.ПС+_УФКС.ПредставлениеОшибки(Ответ));
	//		
	//	КонецЕсли; 
	//	
	//	// перемещаем
	//	Попытка
	//		
	//		ПереместитьФайл(СтрокаФайла.Файл.ПолноеИмя,КаталогПеремещения+"\"+СтрокаФайла.Файл.Имя);
	//		
	//	Исключение
	//		
	//		CW_Журнал.ЗаписатьСообщение("Обмен.МИС.Загрузка","crit","Ошибка перемещения файла """+СтрокаФайла.Файл.ПолноеИмя+""" в папку """+КаталогПеремещения+"""");
	//		
	//	КонецПопытки; 
	//	
	//КонецЦикла; 
	//	
	// --- 
КонецФункции

// регламентная выгрузка
Функция РегламентныйВызовВыгрузки(Обмен,Параметры=Неопределено) Экспорт 
	// --- 
		
	// --- 
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

Функция ПолучитьОбъекты(Обмен,Параметры=Неопределено) Экспорт
	// --- 
	
	// --- 
	
	// --- 
КонецФункции

Функция ВыгрузитьОбъекты(ПараметрыВыгрузки,ТаблицаОбъектов=Неопределено) Экспорт 
	// --- 
	
	// --- 
	
	// --- 
КонецФункции

Функция ВыгрузитьОбъект(ПараметрыВыгрузки,СтруктураОбъекта)
	// --- 
	
	// --- 
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

Функция ЗагрузитьФайл(ПараметрыЗагрузки,ПараметрыФайла)
	// --- 
	
	Попытка
		
		Синхронизация.Очистить(); 
		Объекты.Очистить();
		
		// пытаемся прочитать файл
		Ответ = ПрочитатьФайл(ПараметрыЗагрузки,ПараметрыФайла.Файл.ПолноеИмя);
		Если Ответ.Код <> 0 Тогда
			
			// пишем в лог
			Возврат(_УФКС.Ответ(1,Ответ.ОписаниеОшибки));
			
		КонецЕсли; 
		
		// выполняем синхронизацию
		СинхронизироватьПоРегистру(ПараметрыЗагрузки);
		
		// выполняем автосинхронизацию (для размеров и типов контейнеров)
		ВыполнитьАвтосинхронизацию(ПараметрыЗагрузки);
		
		// проверяем, есть ли несинхронизированные объекты
		Если Синхронизация.НайтиСтроки(_сф.ст_Отбор("Синхронизировано",Ложь)).Количество() <> 0 Тогда
			
			// тут ещё можно передать описание несинхронизированных объектов
			Возврат(_УФКС.Ответ(1,"Есть несинхронизированные объекты"));
						
		КонецЕсли; 
		
		// запускаем функцию загрузки
		Ответ = ЗагрузитьОбъекты(ПараметрыЗагрузки);
		Возврат(Ответ);		
		
	Исключение
		
		_УФКС.Ответ(1,ОписаниеОшибки());
		
	КонецПопытки; 
	
	// --- 
КонецФункции

Функция ПрочитатьФайл(ПараметрыЗагрузки,ИмяФайла) Экспорт 
	// --- 
	
	Пространство = "https://www.coralway.ru/af/xdto";
	// ---------------------------------------------------------------------------- 
	
	// создаём папку в tmp и распаковываем туда архив
	Путь = КаталогВременныхФайлов();
	ИмяКаталога = Путь+Формат(ТекущаяДата(),"ДФ=yyyyMMddHHmmss")+"_"+_сф.УИДСтрокой(CW_Настройки.Пользователь());
	Попытка
		
		СоздатьКаталог(ИмяКаталога);
		
	Исключение
		
		// --- 
		
	КонецПопытки; 
	
	// --- 
	
	Попытка
		
		Архив = Новый ЧтениеZipФайла(ИмяФайла);
		// --- 
		Архив.ИзвлечьВсе(ИмяКаталога,РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
		
	Исключение
	   
		Сообщить(ОписаниеОшибки());
		
	КонецПопытки; 
	
	// проверяем, что в папке есть по крайней мере index.xml
	// ещё там чаще всего будет content.xml и, возможно, af8.xsd
	// если не нашли - пишем в лог сообщение и возвращаем сообщение пользователю
	
	Попытка
		
		ФайлыАрхива = НайтиФайлы(ИмяКаталога,"*",Ложь);
		
	Исключение
	    
		// --- 
		
	КонецПопытки; 
	
	// --- 
	
	СФ = _сф.ст_Создать("index,content,schema");
	Для каждого Файл Из ФайлыАрхива Цикл
		
		Если Файл.Имя = "index.xml" Тогда
			
			СФ.index = Файл.ПолноеИмя;
			
		КонецЕсли; 
		Если Файл.Имя = "content.xml" Тогда
			
			СФ.content = Файл.ПолноеИмя;
			
		КонецЕсли; 
		Если Файл.Имя = "af8.xsd" Тогда
			
			СФ.schema = Файл.ПолноеИмя;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Если СФ.index = Неопределено Тогда
		
		// ... (ахтунг)
		
	КонецЕсли; 
	
	// инициализируем фабрику
	Если СФ.schema <> Неопределено Тогда
		
		// инциализируем фабрику по переданному файлу
		ФайлСхемы = СФ.schema;
		
	Иначе
		
		// инициализируем фабрику по собственному файлу из макета
		Схема = ПолучитьМакет("xsd");
		ФайлСхемы = ИмяКаталога+"\af8.xsd";
		Схема.Записать(ФайлСхемы);
		
	КонецЕсли; 
	
	// создаём фабрику
	ФайлыСхемы = Новый Массив;
	ФайлыСхемы.Добавить(ФайлСхемы);
	Фабрика = СоздатьФабрикуXDTO(ФайлыСхемы);
	
	// ---------------------------------------------------------------------------- 
	
	// читаем шапку index.xml
	// и настройки в ней
	// ---------------------------------------------------------------------------- 
	ЧитатьИндекс = Истина;
	ЧитатьСодержание = (СФ.content <> Неопределено);
	Если ЧитатьИндекс Тогда
		// --- 
		
		ЧтениеХМЛ = Новый ЧтениеXML;
		ЧтениеХМЛ.ОткрытьФайл(СФ.index);
		// --- 
		ЧтениеХМЛ.Прочитать();
		ЧтениеХМЛ.Прочитать();
		
		ТипИнфоБлок = Фабрика.Тип(Пространство,"ЗаголовокПакета");
		ТипСписокТипов = Фабрика.Тип(Пространство,"СписокВыгружаемыхТипов");
		ТипСписокОбъектов = Фабрика.Тип(Пространство,"СписокВыгружаемыхОбъектов");
		// --- 
		Настройки = Фабрика.ПрочитатьXML(ЧтениеХМЛ,ТипИнфоБлок);
		СписокТипов = Фабрика.ПрочитатьXML(ЧтениеХМЛ,ТипСписокТипов);
		СписокОбъектов = Фабрика.ПрочитатьXML(ЧтениеХМЛ,ТипСписокОбъектов);
		// --- 
		ЧтениеХМЛ.Закрыть();
		
		// ---------------------------------------------------------------------------- 
		
		// заполняем настройки
		_сф.ст_УстановитьСвойство(ПараметрыЗагрузки,"ИспользуетсяUID",Настройки.ИспользованиеUID);
		
		// анализируем типы
		Типы = _сф.со_Создать("Имя","Имя,Синоним,Синхронизация,Подтверждение,ТипXDTO",СписокТипов.Тип);
		СинхронизируемыеТипы = Новый Соответствие;
		
		// анализируем объекты
		Для каждого Объект Из СписокОбъектов.Объект Цикл
			
			ТипОбъекта = Типы.Получить(Объект.Тип);
			// --- 
			ПризнакСинхронизации = Истина;
			ПризнакВидимости = Истина;
			ПризнакЗагрузки = Ложь;
			// --- 
			Если ТипОбъекта.Подтверждение Тогда
				
				ПризнакЗагрузки = Истина;
				
			КонецЕсли; 
			// --- 
			Если ТипОбъекта.Синхронизация = "A" Тогда
				
				ПризнакСинхронизации = Ложь;
				
			КонецЕсли;
			// --- 
			Если ТипОбъекта.Имя = "Справочник.Грузоперевозка" Тогда
				
				ПризнакСинхронизации = Истина;
				ПризнакВидимости = Ложь;
				
			КонецЕсли; 
			// --- 
			Если ПризнакЗагрузки Тогда
				// --- 
				
				// проверяем, есть ли у нас соответствие для типа
				СТ = ПараметрыЗагрузки.СоответствиеТипов.Получить(ТипОбъекта.Имя);
				Если СТ = Неопределено Тогда
					
					// для полученного объекта нет соответствия
					Продолжить;
					
				КонецЕсли; 
				// --- 				
				НовыйОбъект = Объекты.Добавить();
				// --- 
				НовыйОбъект.Источник_Тип = CW_Обмены_ПИ.МетаданноеКонфигурации(ТипОбъекта.Имя);
				Если Настройки.ИспользованиеUID Тогда
					НовыйОбъект.Источник_УИД = Новый УникальныйИдентификатор(Объект.Идентификатор);
				Иначе
					НовыйОбъект.Источник_СИ = "<вторая часть типа>"+Объект.Идентификатор; 
				КонецЕсли; 
				НовыйОбъект.Источник_Наименование = Объект.CW_Представление;			
				НовыйОбъект.Загружать = Истина;
				НовыйОбъект.ЗагруженоУспешно = Ложь;
				НовыйОбъект.Приоритет = СТ.Приоритет;
				// --- 
				Если Объект.Режим <> "ПометкаУдаления" Тогда
					
					ЧитатьСодержание = Истина;
					
				КонецЕсли; 
				НовыйОбъект.ДатаВыгрузки = Объект.ДатаВыгрузки;
				
				// --- 
			КонецЕсли; 
			// --- 
			Если ПризнакСинхронизации Тогда
				// --- 
				
				// проверяем, что идентификатор объекта не пустой
				Если ПараметрыЗагрузки.ИспользуетсяUID Тогда
					
					Если СокрЛП(Объект.Идентификатор) = "00000000-0000-0000-0000-000000000000" Тогда
						
						Продолжить;
						
					КонецЕсли; 
					
				Иначе
					
					Если СокрЛП(Объект.Идентификатор) = "" Тогда
						
						Продолжить;
						
					КонецЕсли;  
					
				КонецЕсли; 
				
				НовыйОбъект = Синхронизация.Добавить();
				// --- 
				НовыйОбъект.Источник_Тип = CW_Обмены_ПИ.МетаданноеКонфигурации(ТипОбъекта.Имя);
				Если СинхронизируемыеТипы.Получить(НовыйОбъект.Источник_Тип) = Неопределено Тогда
					
					СинхронизируемыеТипы.Вставить(НовыйОбъект.Источник_Тип,Истина);
					
				КонецЕсли; 
				//НовыйОбъект.Источник_Синоним = ТипОбъекта.Синоним;
				
				Если ПараметрыЗагрузки.ИспользуетсяUID Тогда
					НовыйОбъект.Источник_УИД = Новый УникальныйИдентификатор(Объект.Идентификатор);
				Иначе
					НовыйОбъект.Источник_СИ = "<вторая часть типа>"+Объект.Идентификатор;
				КонецЕсли; 
				НовыйОбъект.Источник_Наименование = Объект.CW_Представление;
				НовыйОбъект.ДатаВыгрузки = Объект.ДатаВыгрузки;
				НовыйОбъект.Видимость = ПризнакВидимости;
				
				// --- 
			КонецЕсли; 
			
		КонецЦикла; 
		
		// сохраняем в найстройках
		_сф.ст_УстановитьСвойство(ПараметрыЗагрузки,"Типы",Типы);
		_сф.ст_УстановитьСвойство(ПараметрыЗагрузки,"СинхронизируемыеТипы",СинхронизируемыеТипы);
		
		// --- 
	КонецЕсли; 
	
	// читаем content.xml
	// ---------------------------------------------------------------------------- 
	Если ЧитатьСодержание Тогда
		// --- 
		
		ЧтениеХМЛ = Новый ЧтениеXML;
		ЧтениеХМЛ.ОткрытьФайл(СФ.content);
		// --- 
		ЧтениеХМЛ.Прочитать();
		//ЧтениеХМЛ.Прочитать();
		
		// читаем в цикле объекты
		// --- 
		
		СинхроСоответствие = Новый Соответствие;
		// --- 
		
		ТипыХДТО = Новый Соответствие;
		// --- 
		
		Пока ЧтениеХМЛ.Прочитать() Цикл
			
			Если ЧтениеХМЛ.Имя = "Объект" И ЧтениеХМЛ.ТипУзла=ТипУзлаXML.НачалоЭлемента Тогда
				
				ЧтениеХМЛ.ПрочитатьАтрибут();
				Идентификатор = ЧтениеХМЛ.Значение;
				ЧтениеХМЛ.ПрочитатьАтрибут();
				Тип = ЧтениеХМЛ.Значение;
				// --- 
				ЧтениеХМЛ.Прочитать();
				// --- 
				ТипОбъекта = Типы.Получить(Тип);
				ТипХДТО = ТипыХДТО.Получить(ТипОбъекта.ТипXDTO);
				Если ТипХДТО = Неопределено Тогда
					ТипХДТО = Фабрика.Тип(Пространство,ТипОбъекта.ТипXDTO);	
					ТипыХДТО.Вставить(ТипОбъекта.ТипXDTO,ТипХДТО);
				КонецЕсли; 
				ОбъектХДТО = Фабрика.ПрочитатьXML(ЧтениеХМЛ,ТипХДТО);
				
				// засовываем в синхросоответствие
				СинхроСоответствие.Вставить(Идентификатор,ОбъектХДТО);
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		ПараметрыЗагрузки.СинхроСоответствие = ПоместитьВоВременноеХранилище(СинхроСоответствие,CW_Настройки.Пользователь().УникальныйИдентификатор());
		
		// --- 
		ЧтениеХМЛ.Закрыть();
		
		// --- 
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

Процедура ВыполнитьАвтосинхронизацию(ПараметрыЗагрузки)
	// --- 
	
	МетаданныеАвтосинхронизации = Новый Соответствие;
	//МетаданныеАвтосинхронизации.Вставить(CW_Обмены_ПИ.МетаданноеКонфигурации("Справочник.ТипыКонтейнеров"),Истина);
	//МетаданныеАвтосинхронизации.Вставить(CW_Обмены_ПИ.МетаданноеКонфигурации("Справочник.РазмерыКонтейнеров"),Истина);
	
	Если МетаданныеАвтосинхронизации.Количество() <> 0 Тогда
		
		Для каждого Стр Из Синхронизация Цикл
			
			Если НЕ Стр.Синхронизировано Тогда
				
				Если МетаданныеАвтосинхронизации.Получить(Стр.Источник_Тип) <> Неопределено Тогда
					
					УстановитьАвтосинхронизацию(ПараметрыЗагрузки,Стр);
					
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

Функция ЗагрузитьОбъекты(ПараметрыЗагрузки) Экспорт 
	
	// снимок таблицы синхронизации
	СинхроТЗ = Синхронизация.Выгрузить();
	// --- 
	СинхроСоответствие = ПолучитьИзВременногоХранилища(ПараметрыЗагрузки.СинхроСоответствие);
	_сф.ст_УстановитьСвойство(ПараметрыЗагрузки,"СинхроСоответствиеОбъект",СинхроСоответствие);
	
	Попытка
		
		// --- 
		НачатьТранзакцию();
		// ---------------------------------------------------------------------------- 
		
		Остановка = Ложь;
		ТекстОшибки = "";
		// внимание, сортировка по приоритету
		Объекты.Сортировать("Приоритет Возр");
		// ---------------------------------------------------------------------------- 
		Для каждого СтрокаОбъекта Из Объекты Цикл
			
			// --- 
			
			// массив объектов к записи
			МассивОбъектов = Новый Массив;
			ФлагОшибкиЗаписи = Ложь;
			
			Идентификатор = ИдентификаторОбъекта(СтрокаОбъекта,ПараметрыЗагрузки);
			
			ХМЛОбъект = СинхроСоответствие.Получить(Строка(Идентификатор));
			Тип = СтрокаОбъекта.Источник_Тип.Наименование;
			
			// ГРУЗОПЕРЕВОЗКИ
			// ---------------------------------------------------------------------------- 
			Если Тип = "Справочник.Грузоперевозка" Тогда
				
				// сначала проверяем, что создан заказ
				Соответствие = ПолучитьТипСоответствия(ПараметрыЗагрузки,Тип);
				СоответствиеСтр = _сф.стр_ПолучитьСтроку(Соответствие,".",2);
				ОбъектСсылка = ПолучитьСвязаннуюСсылку(ПараметрыЗагрузки,Идентификатор,"СправочникСсылка."+СоответствиеСтр);
				Если ОбъектСсылка <> Неопределено Тогда
					Объект = ОбъектСсылка.ПолучитьОбъект();
				Иначе
					
					Объект = Справочники[СоответствиеСтр].СоздатьЭлемент();
					Объект.УстановитьНовыйКод();
					
				КонецЕсли;
				
				Объект.Код = ХМЛОбъект["Номер"]; // будет перезаполнен, подумать
				
				Объект.Клиент = ПолучитьСсылкуСоответствия(ПараметрыЗагрузки,ХМЛОбъект["Клиент"]);
				Объект.CW_Представление = ХМЛОбъект["Контейнер"];
				Объект.ТипПеревозки = ПараметрыЗагрузки.ОсновнойТипПеревозки;
				Объект.Типоразмер = ПолучитьСсылкуСоответствия(ПараметрыЗагрузки,ХМЛОбъект["Типоразмер"]);
				Объект.Комментарий = XMLЗначение(Тип("Строка"),ХМЛОбъект["Комментарий"]);
				
				// --- 
				
				Объект.ПараметрыГрузоперевозки.Очистить(); // обсудить
				// --- 
				Для каждого СтрокаПараметр Из ХМЛОбъект["ПараметрыГрузоперевозки"].ПараметрГрузоперевозки Цикл
					// --- 
					
					Нстр = Объект.ПараметрыГрузоперевозки.Добавить();
					// --- 
					Нстр.Параметр = ПолучитьСсылкуСоответствия(ПараметрыЗагрузки,СтрокаПараметр.Параметр);
					Если Нстр.Параметр.ЭтоКонтрольнаяДата Тогда
						
						Нстр.Значение = XMLЗначение(Тип("Дата"),СтрокаПараметр.Значение);
						Нстр.ЗначениеПлан = СтрокаПараметр.ЗначениеПлан;
						Нстр.ЗначениеФакт = СтрокаПараметр.ЗначениеФакт;
						
					Иначе
						
						ТипПараметра = Нстр.Параметр.ТипЗначения.Типы()[0];
						ЭтоСсылочныйТип = _сф.тип_Ссылочный(ТипПараметра);
						Если ЭтоСсылочныйТип Тогда
							
							Нстр.Значение = ПолучитьСсылкуСоответствия(ПараметрыЗагрузки,СтрокаПараметр.Значение);
							
						Иначе
							
							Нстр.Значение = XMLЗначение(ТипПараметра,СтрокаПараметр.Значение);
							
						КонецЕсли; 
						
					КонецЕсли; 
					
					// --- 
				КонецЦикла; 
				
				
				// --- 
				
				// --- 
				Объект.ОбменДанными.Загрузка = Истина;
				Объект.Записать();
				
				// пропишем в таблицу синхронизации
				СинхроСтрока = _сф.к_НайтиСтроку(Синхронизация,_сф.ст_Отбор("Источник_УИД",СтрокаОбъекта.Источник_УИД));
				// --- 
				СинхроСтрока.Приемник_Объект		= Объект.Ссылка;
				СинхроСтрока.Приемник_УИД			= Объект.Ссылка.УникальныйИдентификатор();
				СинхроСтрока.СозданиеНового 		= Ложь;
				СинхроСтрока.ОбъектЗаписан 			= Истина;
				
				// --- 
				CW_Обмены.ЗаписатьСоответствиеВРегистр(ПараметрыЗагрузки,СинхроСтрока);
				
				// --- 
				МассивОбъектов.Добавить(Объект);
				
			КонецЕсли; 
			
			// ДОХОДЫ
			// ---------------------------------------------------------------------------- 
			Если Тип = "Документ.ДоходыПоГрузоперевозке" Тогда
				
				// сначала проверяем, что создан заказ
				Соответствие = ПолучитьТипСоответствия(ПараметрыЗагрузки,Тип);
				СоответствиеСтр = _сф.стр_ПолучитьСтроку(Соответствие,".",2);
				ОбъектСсылка = ПолучитьСвязаннуюСсылку(ПараметрыЗагрузки,Идентификатор,"ДокументСсылка."+СоответствиеСтр);
				Если ОбъектСсылка <> Неопределено Тогда
					Объект = ОбъектСсылка.ПолучитьОбъект();
				Иначе
					Объект = Документы[СоответствиеСтр].СоздатьДокумент();
				КонецЕсли;
				// ---------------------------------------------------------------------------- 
				
				Объект.Номер = ХМЛОбъект["Номер"];
				Объект.Дата = ХМЛОбъект["Дата"];
				// --- 
				Объект.Организация = ПолучитьСсылкуСоответствия(ПараметрыЗагрузки,ХМЛОбъект["Организация"]);
				Объект.Контрагент = ПолучитьСсылкуСоответствия(ПараметрыЗагрузки,ХМЛОбъект["Контрагент"]);
				Объект.Договор = ПолучитьСсылкуСоответствия(ПараметрыЗагрузки,ХМЛОбъект["Договор"]);
				Объект.Валюта = ПолучитьСсылкуСоответствия(ПараметрыЗагрузки,ХМЛОбъект["Валюта"]);
				// Объект.СпособЗачетаАвансов = 
				Объект.СрокОплаты = ХМЛОбъект["СрокОплаты"];
				// --- 
				ФормироватьСчет = ХМЛОбъект["ФормироватьСчет"];
				ДатаСчета = ?(ФормироватьСчет,ХМЛОбъект["ДатаСчета"],Дата(1,1,1));
				НомерСчета = ?(ФормироватьСчет,ХМЛОбъект["НомерСчета"],"");
				// --- 
				ФормироватьАкт = ХМЛОбъект["ФормироватьАкт"];
				ДатаАкта = ?(ФормироватьАкт,ХМЛОбъект["ДатаАкта"],Дата(1,1,1));
				НомерАкта = ?(ФормироватьАкт,ХМЛОбъект["НомерАкта"],"");
				// --- 
				ФормироватьСФ = ХМЛОбъект["ФормироватьСчетФактуру"];
				ДатаСФ = ?(ФормироватьСФ,ХМЛОбъект["ДатаСчетаФактуры"],Дата(1,1,1));
				НомерСФ = ?(ФормироватьСФ,ХМЛОбъект["НомерСчетаФактуры"],"");
				// --- 
				Объект.ПризнакОтличияАкта = (НомерСчета <> НомерАкта);
				Если Объект.ПризнакОтличияАкта Тогда
					
					Объект.НомерАкта = НомерАкта;
					Объект.ДатаАкта = ДатаАкта;
					
				КонецЕсли; 
				// --- 
				Объект.Комментарий = ХМЛОбъект["Комментарий"];
				// --- 
				Объект.Услуги.Очистить();
				Для каждого СтрокаУслуги Из ХМЛОбъект["Услуги"].Услуга Цикл
					// --- 
					
					Нстр = Объект.Услуги.Добавить();
					Нстр.Грузоперевозка = ПолучитьСсылкуСоответствия(ПараметрыЗагрузки,СтрокаУслуги.Грузоперевозка);
					Нстр.Номенклатура = ПолучитьСсылкуСоответствия(ПараметрыЗагрузки,СтрокаУслуги.Номенклатура);
					Нстр.СтатьяЗатрат = ПолучитьСсылкуСоответствия(ПараметрыЗагрузки,СтрокаУслуги.СтатьяЗатрат);
					Нстр.Представление = СтрокаУслуги.Представление;
					Нстр.Цена = СтрокаУслуги.Цена;
					Нстр.Количество = СтрокаУслуги.Количество;
					Нстр.Сумма = СтрокаУслуги.Сумма;
					Нстр.СуммаНДС = СтрокаУслуги.НДС;
					Нстр.СуммаВсего = СтрокаУслуги.Всего;
					// --- 
					Нстр.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга;
					
					// --- 
				КонецЦикла; 
				
				// --- 
				МассивОбъектов.Добавить(Объект);
				
			КонецЕсли;
			
			// РАСХОДЫ
			// ----------------------------------------------------------------------------
			Если Тип = "Документ.РасходыПоГрузоперевозке" Тогда
				
				// сначала проверяем, что создан заказ
				Соответствие = ПолучитьТипСоответствия(ПараметрыЗагрузки,Тип);
				СоответствиеСтр = _сф.стр_ПолучитьСтроку(Соответствие,".",2);
				ОбъектСсылка = ПолучитьСвязаннуюСсылку(ПараметрыЗагрузки,Идентификатор,"ДокументСсылка."+СоответствиеСтр);
				Если ОбъектСсылка <> Неопределено Тогда
					Объект = ОбъектСсылка.ПолучитьОбъект();
				Иначе
					Объект = Документы[СоответствиеСтр].СоздатьДокумент();
				КонецЕсли;
				// ---------------------------------------------------------------------------- 
				
				Объект.Номер = ХМЛОбъект["Номер"];
				Объект.Дата = ХМЛОбъект["Дата"];
				// --- 
				Объект.Организация = ПолучитьСсылкуСоответствия(ПараметрыЗагрузки,ХМЛОбъект["Организация"]);
				Объект.Контрагент = ПолучитьСсылкуСоответствия(ПараметрыЗагрузки,ХМЛОбъект["Контрагент"]);
				Объект.Договор = ПолучитьСсылкуСоответствия(ПараметрыЗагрузки,ХМЛОбъект["Договор"]);
				Объект.Валюта = ПолучитьСсылкуСоответствия(ПараметрыЗагрузки,ХМЛОбъект["Валюта"]);
				// Объект.СпособЗачетаАвансов = 
				Объект.СрокОплаты = ХМЛОбъект["СрокОплаты"];
				// --- 
				Объект.ПредъявленСчет = ХМЛОбъект["ПредъявленСчет"];
				Объект.ДатаСчета = ?(Объект.ПредъявленСчет,ХМЛОбъект["ДатаСчета"],Дата(1,1,1));
				Объект.НомерСчета = ?(Объект.ПредъявленСчет,ХМЛОбъект["НомерСчета"],"");
				// --- 
				Объект.ПредъявленАкт = ХМЛОбъект["ПредъявленАкт"];
				Объект.ДатаАкта = ?(Объект.ПредъявленАкт,ХМЛОбъект["ДатаАкта"],Дата(1,1,1));
				Объект.НомерАкта = ?(Объект.ПредъявленАкт,ХМЛОбъект["НомерАкта"],"");
				// --- 
				Объект.ПредъявленСФ = ХМЛОбъект["ПредъявленСчетФактура"];
				Объект.ДатаСФ = ?(Объект.ПредъявленСФ,ХМЛОбъект["ДатаСчетаФактуры"],Дата(1,1,1));
				Объект.НомерСФ = ?(Объект.ПредъявленСФ,ХМЛОбъект["НомерСчетаФактуры"],"");
				// --- 
				Объект.Комментарий = ХМЛОбъект["Комментарий"];
				
				// --- 
				
				Объект.Услуги.Очистить();
				Для каждого СтрокаУслуги Из ХМЛОбъект["Услуги"].Услуга Цикл
					// --- 
					
					Нстр = Объект.Услуги.Добавить();
					Нстр.Грузоперевозка = ПолучитьСсылкуСоответствия(ПараметрыЗагрузки,СтрокаУслуги.Грузоперевозка);
					Нстр.Номенклатура = ПолучитьСсылкуСоответствия(ПараметрыЗагрузки,СтрокаУслуги.Номенклатура);
					Нстр.СтатьяЗатрат = ПолучитьСсылкуСоответствия(ПараметрыЗагрузки,СтрокаУслуги.СтатьяЗатрат);
					Нстр.Представление = СтрокаУслуги.Представление;
					Нстр.Цена = СтрокаУслуги.Цена;
					Нстр.Количество = СтрокаУслуги.Количество;
					Нстр.Сумма = СтрокаУслуги.Сумма;
					Нстр.СуммаНДС = СтрокаУслуги.НДС;
					Нстр.СуммаВсего = СтрокаУслуги.Всего;
					// --- 
					Нстр.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты;
					
					// --- 
				КонецЦикла; 
				
				// --- 
				МассивОбъектов.Добавить(Объект);
				
			КонецЕсли;
			
			СсылкаОбъектаСоответствия = Неопределено;
			
			Если НЕ ФлагОшибкиЗаписи Тогда
				
				Для каждого Объект Из МассивОбъектов Цикл
					
					Попытка
						
						//Сообщить(Объект);
						Объект.ОбменДанными.Загрузка = Истина;
						Объект.Записать();
						СсылкаОбъектаСоответствия = Объект.Ссылка;
						
					Исключение
						
						ТекстОшибки = ОписаниеОшибки();
						ФлагОшибкиЗаписи = Истина;
						Прервать;
						
					КонецПопытки;
					
				КонецЦикла;
				
			КонецЕсли; 
			
			Если НЕ ФлагОшибкиЗаписи Тогда
				
				// запишем синхронизацию в регистр
				Для каждого Объект Из МассивОбъектов Цикл
					
					Попытка
						
						Запись = РегистрыСведений.CW_СинхронизацияОбъектов.СоздатьМенеджерЗаписи();
						Запись.Источник_Тип = СтрокаОбъекта.Источник_Тип;
						Если ПараметрыЗагрузки.ИспользуетсяUID Тогда
							
							Запись.Источник_УИД = Идентификатор;
							
						Иначе
							
							Запись.Источник_СИ = Идентификатор;
							
						КонецЕсли; 
						
						Запись.Источник_Идентификатор = ПараметрыЗагрузки.Обмен;
						Запись.Приемник_Объект = Объект.Ссылка;
						Запись.Приемник_УИД = Объект.Ссылка.УникальныйИдентификатор();
						Запись.Источник_Наименование = СтрокаОбъекта.Источник_Наименование;
						Запись.флНезавершена = Ложь;
						Запись.Записать();
						
					Исключение
						
						ФлагОшибкиЗаписи = Истина;
						Прервать;
						
					КонецПопытки; 
										
				КонецЦикла;
				
				// пометим как загруженный успешно
				УстановитьФлагЗагрузкиОбъекта(ПараметрыЗагрузки,Идентификатор);
				
			Иначе
				
				Остановка = Истина;
				Прервать;
				
			КонецЕсли; 
			
			СтрокаОбъекта.ЗагруженоУспешно = Истина;
			СтрокаОбъекта.ОбъектСоответствия = СсылкаОбъектаСоответствия;
			
		КонецЦикла; 
		
		Если Остановка Тогда
			
			Если ТранзакцияАктивна() Тогда
				
				ОтменитьТранзакцию();
				
			КонецЕсли; 
			
			_сф.ст_УстановитьСвойство(ПараметрыЗагрузки,"СинхроСоответствиеОбъект",Неопределено);
			
			Возврат(_УФКС.Ответ(1,"Ошибка при загрузке:"+ТекстОшибки));
			
		КонецЕсли; 
		
		// ---------------------------------------------------------------------------- 
		ЗафиксироватьТранзакцию();
		// --- 
		
		_сф.ст_УстановитьСвойство(ПараметрыЗагрузки,"СинхроСоответствиеОбъект",Неопределено);
		
		Возврат(_УФКС.Ответ());
		
	Исключение
		
		_сф.ст_УстановитьСвойство(ПараметрыЗагрузки,"СинхроСоответствиеОбъект",Неопределено);
		
		Если ТранзакцияАктивна() Тогда
			
			ОтменитьТранзакцию();
			
		КонецЕсли; 
		
		Синхронизация.Загрузить(СинхроТЗ);
		
		Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
		
	КонецПопытки; 
	
		
КонецФункции

// --- 

Функция ИдентификаторОбъекта(СтрокаОбъекта,ПараметрыЗагрузки)
	// --- 
	
	Если ПараметрыЗагрузки.ИспользуетсяUID Тогда
		
		Возврат(СтрокаОбъекта.Источник_УИД);
		
	Иначе
		
		Возврат(СтрокаОбъекта.Источник_СИ);
		
	КонецЕсли; 
	
	// --- 
КонецФункции
  

// ---------------------------------------------------------------------------- 

Функция СоответствиеМетаданных() Экспорт 
	// --- 
	
	СТ = Новый Соответствие;
	СТ.Вставить("Справочник.Грузоперевозка",СМ("Справочник.CW_Грузоперевозки","Грузоперевозка",-1));
	СТ.Вставить("Справочник.Организации",СМ("Справочник.Организации","Организации"));
	СТ.Вставить("Справочник.Контрагенты",СМ("Справочник.Контрагенты","Контрагенты"));
	СТ.Вставить("Справочник.Договоры",СМ("Справочник.CW_ДоговорыПоГрузоперевозкам","Договоры"));
	СТ.Вставить("Справочник.Валюты",СМ("Справочник.Валюты","Валюты"));
	СТ.Вставить("Справочник.Номенклатура",СМ("Справочник.Номенклатура","Номенклатура"));
	СТ.Вставить("Справочник.ТипоразмерыКонтейнеров",СМ("Справочник.CW_ТипоразмерыКонтейнеров","ТипоразмерыКонтейнеров"));
	СТ.Вставить("ПланВидовХарактеристик.ПараметрыГрузоперевозок",СМ("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок","ПараметрыГрузоперевозок"));
	
	СТ.Вставить("Документ.РасходыПоГрузоперевозке",СМ("Документ.CW_РасходыПоГрузоперевозке","Расходы",10));
	СТ.Вставить("Документ.ДоходыПоГрузоперевозке",СМ("Документ.CW_ДоходыПоГрузоперевозке","Доходы",11));
	//СТ.Вставить("",СМ(,));
	//СТ.Вставить("",СМ(,));
	
	Возврат(СТ);
	
	// --- 
КонецФункции

Функция СМ(Имя,ИмяХДТО,Приоритет=0)
	// --- 
	
	Возврат(Новый Структура("Имя,ТипХДТО,Приоритет",Имя,ИмяХДТО,Приоритет));
	
	// --- 
КонецФункции

// --- 

Функция ПолучитьКИ(Объект,ВидКИ)
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = &Тип
	|	И КонтактнаяИнформация.Вид = &Вид";
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Тип", ВидКИ.Тип); 
	Запрос.УстановитьПараметр("Вид", ВидКИ); 
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	ПЭ = _сф.к_ПервыйЭлемент(ТЗ);
	Если ПЭ=Неопределено Тогда
		
		Возврат("");
		
	Иначе
		
		Возврат(ПЭ.Представление);
		
	КонецЕсли;
	
	// --- 
КонецФункции
  

// --- 

Функция СинхронизироватьПоРегистру(ПараметрыЗагрузки) Экспорт 
	
	Попытка
		
		ИспользуетсяUID = ПараметрыЗагрузки.ИспользуетсяUID;
		
		Если ИспользуетсяUID Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	CW_СинхронизацияОбъектов.Приемник_УИД,
			|	CW_СинхронизацияОбъектов.Приемник_Объект,
			|	CW_СинхронизацияОбъектов.флНезавершена,
			|	CW_СинхронизацияОбъектов.ПолитикаСинхронизации
			|ИЗ
			|	РегистрСведений.CW_СинхронизацияОбъектов КАК CW_СинхронизацияОбъектов
			|ГДЕ
			|	CW_СинхронизацияОбъектов.Источник_УИД = &ИдентификаторОбъекта
			|	И CW_СинхронизацияОбъектов.Источник_Идентификатор = &ИнформационнаяБаза";
			
		Иначе
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	CW_СинхронизацияОбъектов.Приемник_УИД,
			|	CW_СинхронизацияОбъектов.Приемник_Объект,
			|	CW_СинхронизацияОбъектов.флНезавершена,
			|	CW_СинхронизацияОбъектов.ПолитикаСинхронизации
			|ИЗ
			|	РегистрСведений.CW_СинхронизацияОбъектов КАК CW_СинхронизацияОбъектов
			|ГДЕ
			|	CW_СинхронизацияОбъектов.Источник_СИ = &ИдентификаторОбъекта
			|	И CW_СинхронизацияОбъектов.Источник_Идентификатор = &ИнформационнаяБаза";
			
		КонецЕсли; 
		
		Запрос.УстановитьПараметр("ИнформационнаяБаза", ПараметрыЗагрузки.Обмен);
		
		Для каждого Стр Из Синхронизация Цикл
			
			Если НЕ Стр.Синхронизировано Тогда
				
				Если ИспользуетсяUID Тогда
					
					Запрос.УстановитьПараметр("ИдентификаторОбъекта", Новый УникальныйИдентификатор(Стр.Источник_УИД));
					
				Иначе
					
					Запрос.УстановитьПараметр("ИдентификаторОбъекта", Стр.Источник_СИ);
					
				КонецЕсли; 
				
				ТЗ = Запрос.Выполнить().Выгрузить();
				
				Для Каждого Строка Из ТЗ Цикл
					
					Стр.Приемник_УИД = Строка.Приемник_УИД;
					Стр.Приемник_Объект = Строка.Приемник_Объект;
					Стр.Синхронизировано = Истина;
					Стр.НомерКартинки = ?(Стр.Синхронизировано,1,0); 
					Стр.ПолитикаСинхронизации = Строка.ПолитикаСинхронизации;
					Если Стр.ПолитикаСинхронизации.Пустая() Тогда
						Стр.ПолитикаСинхронизации = Перечисления.CW_ПолитикаСинхронизацииОбъектов.Постоянная;			
					КонецЕсли; 
					
					Если Строка.флНезавершена Тогда
						
						Стр.СозданиеНового = Истина;
						Стр.Приемник_Наименование = "< авто >";
						
					Иначе
						
						Стр.СозданиеНового = Ложь;
						Стр.Приемник_Наименование = Строка(Стр.Приемник_Объект);
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат(_УФКС.Ответ());
		
	Исключение
		
		Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
		
	КонецПопытки; 
	
КонецФункции

// процедура создания объекта соответствия, для автосинхронизации
Процедура УстановитьАвтосинхронизацию(ПараметрыЗагрузки,СинхроСтрока) 
	
	СинхроСтрока.СозданиеНового = Истина;
	СинхроСтрока.Приемник_УИД = CW_Обмены.ПолучитьУИД(Неопределено);
	СинхроСтрока.Синхронизировано = Истина;
	СинхроСтрока.Приемник_Наименование = "< авто >";
	CW_Обмены.ЗаписатьСоответствиеВРегистр(ПараметрыЗагрузки,СинхроСтрока);
	
КонецПроцедуры


// запись соответствия из синхростроки в регистр с замещением существующей записи
// универсальная - доработки не требуются

// --- 


// устанавливает флаг успешной загрузки документа
Процедура  УстановитьФлагЗагрузкиОбъекта(ПараметрыЗагрузки,УИД)
	
	Если ПараметрыЗагрузки.ИспользуетсяUID Тогда
		
		Синхрострока = Объекты.Найти(Новый УникальныйИдентификатор(УИД),"Источник_УИД");
		
	Иначе
		
		Синхрострока = Объекты.Найти(УИД,"Источник_СИ");
		
	КонецЕсли; 
	
	Если Синхрострока <> Неопределено Тогда
		
		Синхрострока.ЗагруженоУспешно = Истина;
		Возврат;
				
	КонецЕсли;
	
КонецПроцедуры // УстановитьФлагЗагрузки()

// --- 

Функция ПолучитьСвязанныеСсылки(ПараметрыЗагрузки,УИД)
	
	МассивСсылок = Новый Массив;
	
	Если ПараметрыЗагрузки.ИспользуетсяUID Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	CW_СинхронизацияОбъектов.Приемник_Объект
		|ИЗ
		|	РегистрСведений.CW_СинхронизацияОбъектов КАК CW_СинхронизацияОбъектов
		|ГДЕ
		|	CW_СинхронизацияОбъектов.Источник_УИД = &Источник_УИД
		|	И CW_СинхронизацияОбъектов.Источник_Идентификатор = &Источник_Идентификатор";
		Запрос.УстановитьПараметр("Источник_УИД", Новый УникальныйИдентификатор(УИД));
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	CW_СинхронизацияОбъектов.Приемник_Объект
		|ИЗ
		|	РегистрСведений.CW_СинхронизацияОбъектов КАК CW_СинхронизацияОбъектов
		|ГДЕ
		|	CW_СинхронизацияОбъектов.Источник_СИ = &Источник_СИ
		|	И CW_СинхронизацияОбъектов.Источник_Идентификатор = &Источник_Идентификатор";
		Запрос.УстановитьПараметр("Источник_СИ", УИД);
		
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("Источник_Идентификатор", ПараметрыЗагрузки.Обмен);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Для Каждого Стр Из ТЗ Цикл
		 МассивСсылок.Добавить(Стр.Приемник_Объект);
	КонецЦикла;	
	Если МассивСсылок.Количество()=0 Тогда
		
		Возврат(Неопределено);
		
	Иначе
		
		Возврат(МассивСсылок);
		
	КонецЕсли;
	
КонецФункции // ПолучитьСвязанныеСсылки()

Функция ПолучитьСвязаннуюСсылку(ПараметрыЗагрузки,УИД,Тип)
	
	// обрезаем
	
	Мстр = ПолучитьСвязанныеСсылки(ПараметрыЗагрузки,УИД);
	Если Мстр <> Неопределено Тогда
		
		Для каждого Стр Из Мстр Цикл
			
			Если ТипЗнч(Стр) = Тип(Тип) Тогда
				
				Возврат(Стр);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат(Неопределено);
	
КонецФункции // ПолучитьСвязаннуюСсылку()

Функция ПолучитьТипСоответствия(ПараметрыЗагрузки,ТипУУ)
	
	Возврат(ПараметрыЗагрузки.СоответствиеТипов.Получить(ТипУУ).Имя);
	
КонецФункции // ()

// ---------------------------------------------------------------------------- 

// возвращает ссылку на объект БУ по  уиду УУ
Функция ПолучитьСсылкуСоответствия(ПараметрыЗагрузки,Идентификатор) // первая главная функция
	
	Если Идентификатор = Неопределено Тогда
		
		Возврат(Неопределено);
		
	КонецЕсли;
	
	Если Идентификатор = "" Тогда
		
		Возврат(Неопределено);
		
	КонецЕсли;
	
	Если Идентификатор="00000000-0000-0000-0000-000000000000" Тогда
		
		Возврат(Неопределено);
		
	КонецЕсли;
		
	// --- 
	
	Если ПараметрыЗагрузки.ИспользуетсяUID Тогда
		
		Синхрострока = Синхронизация.Найти(Новый УникальныйИдентификатор(Идентификатор),"Источник_УИД");
		
	Иначе
		
		Синхрострока = Синхронизация.Найти(Идентификатор,"Источник_СИ");
		
	КонецЕсли; 
	
	Если Синхрострока = Неопределено Тогда
		
		Возврат(Неопределено);
		
	КонецЕсли;
	
	// --- 
	
	Ссылка = СоздатьОбновитьПоСинхроСтроке(ПараметрыЗагрузки,Синхрострока);
	
	Если Ссылка = Неопределено Тогда
		
		Сообщить("Идентификатор="+Строка(Идентификатор));
		ВызватьИсключение "Ошибка создания объекта!";
		
	КонецЕсли; 
	
	Синхрострока.Приемник_Объект = Ссылка;
		
	Возврат(Синхрострока.Приемник_Объект);
	
КонецФункции // СсылкаБУ()

// создание объекта в режиме автосинхронизации
Функция СоздатьОбновитьПоСинхроСтроке(ПараметрыЗагрузки,СинхроСтрока) // вторая главная функция
	
	Попытка
		
		// создаем/модифицируем один раз (!)
		Если СинхроСтрока.ОбъектЗаписан Тогда
			
			Возврат(СинхроСтрока.Приемник_Объект);
			
		КонецЕсли; 
		// --- 
		Если СинхроСтрока.СозданиеНового Тогда
			
			Соответствие = ПолучитьТипСоответствия(ПараметрыЗагрузки,СинхроСтрока.Источник_Тип.Наименование);
			СоответствиеСтр = _сф.стр_ПолучитьСтроку(Соответствие,".",2);
			Справочник = Справочники[СоответствиеСтр].СоздатьЭлемент();
			
		Иначе
			
			Если СинхроСтрока.ПолитикаСинхронизации = Перечисления.CW_ПолитикаСинхронизацииОбъектов.Первичная Тогда
				
				Возврат(СинхроСтрока.Приемник_Объект);
				
			Иначе
				
				Справочник = СинхроСтрока.Приемник_Объект.ПолучитьОбъект();
				
			КонецЕсли; 
			
		КонецЕсли;
		
		// ---------------------------------------------------------------------------- 
		
		Если ПараметрыЗагрузки.ИспользуетсяUID Тогда
			
			ХМЛОбъект = ПараметрыЗагрузки.СинхроСоответствиеОбъект.Получить(Строка(СинхроСтрока.Источник_УИД));
			
		Иначе
			
			ХМЛОбъект = ПараметрыЗагрузки.СинхроСоответствиеОбъект.Получить(СинхроСтрока.Источник_СИ);
			
		КонецЕсли; 
		
		// --- 
		 
		Если Синхрострока.Источник_Тип.Наименование = "Справочник.Организации" Тогда
			
			// --- 
			//Справочник = Справочники.Организации.СоздатьЭлемент();
			Справочник.Наименование 		= ХМЛОбъект["Наименование"];
			Справочник.НаименованиеПолное 	= ХМЛОбъект["ПолноеНаименование"];
			Справочник.Префикс				= СокрЛП(ХМЛОбъект["Префикс"]);
			// --- 
			Справочник.ИНН 					= ХМЛОбъект["ИНН"];
			Справочник.КПП 					= ХМЛОбъект["КПП"];
			// --- 
			
		КонецЕсли;
		// --- МИС
		Если Синхрострока.Источник_Тип.Наименование = "Справочник.Контрагенты" Тогда
			
			// --- 
			//Справочник = Справочники.Контрагенты.СоздатьЭлемент();
			Справочник.Наименование 		= СокрЛП(Синхрострока.Источник_Наименование);
			Справочник.НаименованиеПолное 	= "";
			// --- 
			Справочник.ИНН 					= "";
			Справочник.КПП 					= "";
			// --- 
			
		КонецЕсли;
		// --- 
		Если Синхрострока.Источник_Тип.Наименование = "Справочник.Договоры" Тогда
			
			// --- 
			//Справочник = Справочники.CW_ДоговорыПоГрузоперевозкам.СоздатьЭлемент(); // тмп
			Справочник.Наименование					= СокрЛП(СинхроСтрока.Источник_Наименование);
			Справочник.РедактироватьНаименование	= ХМЛОбъект["РедактироватьНаименование"];
			Справочник.Владелец 					= ПолучитьСсылкуСоответствия(ПараметрыЗагрузки,ХМЛОбъект["Контрагент"]);
			Справочник.Организация					= ПолучитьСсылкуСоответствия(ПараметрыЗагрузки,ХМЛОбъект["Организация"]);
			Справочник.ВалютаДоговора		 		= ПолучитьСсылкуСоответствия(ПараметрыЗагрузки,ХМЛОбъект["Валюта"]);
			Справочник.ТипДоговора					= ПолучитьСсылкуСоответствия(ПараметрыЗагрузки,ХМЛОбъект["ТипДоговора"]);
			// --- 
			Справочник.НомерДоговора 				= СокрЛП(ХМЛОбъект["НомерДоговора"]);
			Справочник.ДатаДоговора					= ХМЛОбъект["ДатаДоговора"];
			Справочник.СрокДействияДоговора 		= ХМЛОбъект["СрокДействияДоговора"];
			
			Если ХМЛОбъект["ВидДоговора"] = "СПокупателем" Тогда
				Справочник.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
			ИначеЕсли ХМЛОбъект["ВидДоговора"] = "СПоставщиком" Тогда
				Справочник.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
			КонецЕсли;
			
			Если Синхрострока.СозданиеНового Тогда
				
				// создаем учётный договор
				
				Договор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
				Договор.Наименование = Справочник.Наименование;
				Договор.Владелец = Справочник.Владелец;
				Договор.Организация = Справочник.Организация;
				Договор.ВидДоговора = Справочник.ВидДоговора;
				Договор.Номер = Справочник.НомерДоговора;
				Договор.Дата = Справочник.ДатаДоговора;
				Договор.ВидДоговора = Справочник.ВидДоговора;
				Договор.ВалютаВзаиморасчетов = Справочник.ВалютаДоговора;
				// --- 
				Договор.Записать();
				
				Справочник.УчетныйДоговор = Договор.Ссылка
				           				
			КонецЕсли; 
			
			Справочник.ОбменДанными.Загрузка = Истина;
			// --- 			       			
			
		КонецЕсли;
		// --- 
		Если Синхрострока.Источник_Тип.Наименование = "Справочник.ТипыДоговоров" Тогда
			
			//Справочник = Справочники.CW_ТипыДоговоров.СоздатьЭлемент(); // тмп
			Справочник.Наименование				= СокрЛП(Синхрострока.Источник_Наименование);
						
		КонецЕсли;
		// --- 
		Если Синхрострока.Источник_Тип.Наименование = "Справочник.Номенклатура" Тогда
			
			//Справочник = Справочники.Номенклатура.СоздатьЭлемент(); // тмп
			Справочник.Наименование				= ХМЛОбъект["Наименование"];
			Справочник.НаименованиеПолное 		= ХМЛОбъект["ПолноеНаименование"];
			//Справочник.СтавкаНДС				= ХМЛОбъект["Ставка"];
			Справочник.Услуга 					= ХМЛОбъект["Услуга"];
			
		КонецЕсли;
		// --- 
		Если Синхрострока.Источник_Тип.Наименование = "Справочник.СтатьиЗатрат" Тогда
			
			//Справочник = Справочники.СтатьиЗатрат.СоздатьЭлемент(); // тмп
			Справочник.Наименование				= СокрЛП(Синхрострока.Источник_Наименование);
						
		КонецЕсли;
		// --- 
		Если Синхрострока.Источник_Тип.Наименование = "Справочник.ВидыДеятельности" Тогда
			
			//Справочник = Справочники.НоменклатурныеГруппы.СоздатьЭлемент(); // тмп
			Справочник.Наименование				= СокрЛП(Синхрострока.Источник_Наименование);
						
		КонецЕсли;
		
		Если Синхрострока.Источник_Тип.Наименование = "Справочник.ТипыПеревозок" Тогда
			
			//<ВидПеревозки>Контейнерная</ВидПеревозки>
			//Справочник = Справочники.CW_ТипыПеревозок.СоздатьЭлемент(); // тмп
			Справочник.Наименование				= СокрЛП(Синхрострока.Источник_Наименование);
			Если ХМЛОбъект["ВидПеревозки"]="Контейнерная" Тогда
				
				Справочник.ВидПеревозки = Перечисления.CW_ВидыПеревозок.Контейнер;
				
			Иначе
				
				Справочник.ВидПеревозки = Перечисления.CW_ВидыПеревозок.Прочее;
				
			КонецЕсли;  
						
		КонецЕсли;
		// --- МИС
		Если Синхрострока.Источник_Тип.Наименование = "Справочник.ТипыКонтейнеров" Тогда
			
			//Справочник = Справочники.CW_ТипыКонтейнеров.СоздатьЭлемент(); // тмп
			Справочник.Наименование				= СокрЛП(ХМЛОбъект["Наименование"]);
			Справочник.Код						= СокрЛП(ХМЛОбъект["Наименование"]);
												
		КонецЕсли;
		// --- МИС
		Если Синхрострока.Источник_Тип.Наименование = "Справочник.РазмерыКонтейнеров" Тогда
			
			//Справочник = Справочники.CW_РазмерыКонтейнеров.СоздатьЭлемент(); // тмп
			Справочник.Наименование				= СокрЛП(ХМЛОбъект["Наименование"]);
												
		КонецЕсли;
		
		Справочник.Записать();
		
		//// ведомые объекты договоров: параметры договора и учётный договор
		//Если Синхрострока.Источник_Тип.Наименование = "Справочник.Договоры" Тогда
		//	
		//	// переносим параметры договора
		//	
		//	// очищаем существующие параметры
		//	НаборЗаписей = РегистрыСведений.CW_ПараметрыДоговоров.СоздатьНаборЗаписей();
		//	НаборЗаписей.Отбор.Договор.Значение = Справочник.Ссылка;
		//	НаборЗаписей.Отбор.Договор.Использование = Истина;
		//	НаборЗаписей.Отбор.Контрагент.Значение = Справочник.Владелец;
		//	НаборЗаписей.Отбор.Контрагент.Использование = Истина;
		//	НаборЗаписей.Записать();
		//	
		//	ТЗПараметров = ХМЛОбъект["Параметры"].Скопировать();
		//	
		//	Для каждого Стр Из ТЗПараметров Цикл
		//		
		//		Стр.Период = XMLЗначение(Тип("Дата"),Стр.Период);
		//		Если Стр.ПорядокЗачетаАвансов = "Автоматически" Тогда
		//			
		//			Стр.ПорядокЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.Автоматически;
		//			
		//		ИначеЕсли Стр.ПорядокЗачетаАвансов = "ПоДокументу" Тогда
		//			
		//			Стр.ПорядокЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.ПоДокументу;
		//			
		//		ИначеЕсли Стр.ПорядокЗачетаАвансов = "НеЗачитывать" Тогда
		//			
		//			Стр.ПорядокЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.НеЗачитывать;
		//			
		//		КонецЕсли;
		//		Стр.ЗановоФормироватьПредставлениеПриПеревыставленииЗатрат = XMLЗначение(Тип("Булево"),Стр.ЗановоФормироватьПредставлениеПриПеревыставленииЗатрат);
		//		Стр.КоличествоДнейПросрочки = XMLЗначение(Тип("Число"), Стр.КоличествоДнейПросрочки);
		//		
		//		Запись = НаборЗаписей.Добавить();
		//		ЗаполнитьЗначенияСвойств(Запись,Стр);
		//		Запись.Контрагент = Справочник.Владелец;
		//		Запись.Договор = Справочник.Ссылка;
		//		
		//	КонецЦикла; 
		//	
		//	НаборЗаписей.Записать(Истина);
		//	
		//КонецЕсли; 
		
		// --- 
		
		СинхроСтрока.Приемник_Объект		= Справочник.Ссылка;
		СинхроСтрока.Приемник_УИД			= Справочник.Ссылка.УникальныйИдентификатор();
		СинхроСтрока.СозданиеНового 		= Ложь;
		СинхроСтрока.ОбъектЗаписан 			= Истина;
		
		// --- 
		CW_Обмены.ЗаписатьСоответствиеВРегистр(ПараметрыЗагрузки,СинхроСтрока);
		// --- 
		
		Возврат(Справочник.Ссылка);
		
	Исключение
		
		ОтменитьТранзакцию();
		// --- 
		
		СинхроСтрока.Приемник_Объект		= Неопределено;
		СинхроСтрока.ОбъектЗаписан 			= Ложь;
		
		Сообщить(ОписаниеОшибки());
		// --- 
		Возврат(Неопределено);
		
	КонецПопытки;
	
КонецФункции // ()

// ---------------------------------------------------------------------------- 
#КонецЕсли
